import { untranslated } from "../common/infrastructure/utilities/untranslsated";
import { Seo } from "../common/Seo";
import { Card } from "./components/Card";
import styles from "./Reformer.module.scss";
import "swiper/swiper-bundle.css";

export const Reformer = () => {
  return (
    <div className={styles.reformer}>
      <Seo
        title={"🤸🏻‍♂️ Реформър"}
        description={
          "Научи всичко за реформър пилатес тренировките в Studio Reform. Персонализирани класове с опитни инструктори за начинаещи и напреднали."
        }
      />

      <div className={styles.reformer_heading}>
        <h1>Пилатес Реформър</h1>
      </div>
      <div className={styles.reformer_subheading}>
        <h2>
          {untranslated("Пилатес Реформър – осъзнато движение, видима промяна")}
        </h2>

        <div>
          <span>
            {untranslated(
              "Пилатес Реформър е съвременен метод за трениране на тялото чрез система от упражнения, изпълнявани на специален уред, наречен реформър. Този уред е създаден с идеята да надгради класическия пилатес, като добавя съпротивление, прецизност и динамика към всяко движение."
            )}
          </span>
          <br />
          <span>
            {untranslated(
              "Реформърът представлява стабилна рамка с подвижна платформа, пружини с регулируемо съпротивление, въжета и опори, които позволяват многофункционално и дълбоко ангажиращо трениране на цялото тяло."
            )}
          </span>
        </div>
      </div>
      <div className={styles.reformer_cards}>
        <Card
          title={untranslated("Защо Реформър, а не класически пилатес?")}
          text={untranslated(
            "Докато традиционният пилатес (на постелка) работи предимно с тежестта на тялото и е отличен за изграждане на стабилност, реформърът въвежда допълнително съпротивление и възможност за персонализиране на натоварването, което прави тренировките:по-интензивни, по-точни, по-добре адаптирани към индивидуалните нужди, по-ефективни при изграждане на сила, гъвкавост и контрол."
          )}
        />
        <Card
          title={untranslated("Ползи за тялото и ума")}
          text={untranslated(
            "Пилатес Реформър носи цялостна трансформация както за тялото, така и за ума. С всяка тренировка тялото става по-силно отвътре навън. Упражненията активират дълбоките мускули на корема, гърба и таза – това така наречено 'ядро' е в основата на всяко движение и е отговорно за стабилността, баланса и добрата стойка. С времето коремът се прибира и стяга, гърбът се изправя, а цялото тяло започва да се движи с повече лекота, увереност и грациозност."
          )}
        />
        <Card
          text={untranslated(
            "Пилатес Реформър също така подпомага правилното подреждане на тялото в пространството и коригира натрупаните навици на неправилна стойка и напрежение. Движенията са плавни и контролирани, което щади ставите и предотвратява претоварване, а дишането е дълбоко и осъзнато – елемент, който успокоява ума и повишава фокуса. Така тренировката се превръща не само в грижа за физическата форма, но и в своеобразна медитация в движение. Резултатът е не просто стегнато тяло, а усещане за вътрешна стабилност, лекота и присъствие в момента."
          )}
        />
      </div>

      <h1 className={styles.why_reform_heading}>
        {untranslated("Защо REFORM Pilates Studio?")}
      </h1>

      <div className={styles.why_reform}>
        <div className={styles.why_reform_left}></div>
        <div className={styles.why_reform_right}>
          <p>
            В REFORM Pilates Studio не просто предлагаме Реформър тренировки –
            ние създаваме пространство за дълбока лична трансформация чрез
            движение. Работим с опитни инструктори, съвременни уреди и
            индивидуален подход, който поставя твоята стабилност, безопасност и
            развитие в центъра на вниманието.
          </p>
          <span>Готов ли си да се движиш различно?</span>
          <p>
            Пилатес Реформър е покана към теб да дишаш по-дълбоко, да се движиш
            по-леко и да се чувстваш по-добре – отвътре и отвън. Това не е
            просто тренировка. Това е начин да си у дома в тялото си.
          </p>
        </div>
      </div>
    </div>
  );
};
